trol73/avr-make/asm/include/ATxmega256C3def.inc
.equ TCF2_CTRLA = 2816		// Control Register A
.equ TCF2_CTRLB = 2817		// Control Register B
.equ TCF2_CTRLC = 2818		// Control register C
.equ TCF2_CTRLE = 2820		// Control Register E
.equ TCF2_INTCTRLA = 2822		// Interrupt Control Register A
.equ TCF2_INTCTRLB = 2823		// Interrupt Control Register B
.equ TCF2_CTRLF = 2825		// Control Register F
.equ TCF2_INTFLAGS = 2828		// Interrupt Flag Register
.equ TCF2_LCNT = 2848		// Low Byte Count
.equ TCF2_HCNT = 2849		// High Byte Count
.equ TCF2_LPER = 2854		// Low Byte Period
.equ TCF2_HPER = 2855		// High Byte Period
.equ TCF2_LCMPA = 2856		// Low Byte Compare A
.equ TCF2_HCMPA = 2857		// High Byte Compare A
.equ TCF2_LCMPB = 2858		// Low Byte Compare B
.equ TCF2_HCMPB = 2859		// High Byte Compare B
.equ TCF2_LCMPC = 2860		// Low Byte Compare C
.equ TCF2_HCMPC = 2861		// High Byte Compare C
.equ TCF2_LCMPD = 2862		// Low Byte Compare D
.equ TCF2_HCMPD = 2863		// High Byte Compare D


; ***** ALL MODULE BASE ADRESSES *****************************************

.equ GPIO_base = 0x0000		// General Purpose IO Registers
.equ VPORT0_base = 0x0010		// Virtual Port 0
.equ VPORT1_base = 0x0014		// Virtual Port 1
.equ VPORT2_base = 0x0018		// Virtual Port 2
.equ VPORT3_base = 0x001C		// Virtual Port 3
.equ OCD_base = 0x002E		// On-Chip Debug System
.equ CPU_base = 0x0030		// CPU Registers
.equ CLK_base = 0x0040		// Clock System
.equ SLEEP_base = 0x0048		// Sleep Controller
.equ OSC_base = 0x0050		// Oscillator Control
.equ DFLLRC32M_base = 0x0060		// DFLL for 32MHz RC Oscillator
.equ DFLLRC2M_base = 0x0068		// DFLL for 2MHz RC Oscillator
.equ PR_base = 0x0070		// Power Reduction
.equ RST_base = 0x0078		// Reset Controller
.equ WDT_base = 0x0080		// Watch-Dog Timer
.equ MCU_base = 0x0090		// MCU Control
.equ PMIC_base = 0x00A0		// Programmable Interrupt Controller
.equ PORTCFG_base = 0x00B0		// Port Configuration
.equ CRC_base = 0x0D0		// CRC Module
.equ EVSYS_base = 0x0180		// Event System
.equ NVM_base = 0x01C0		// Non Volatile Memory Controller
.equ ADCA_base = 0x0200		// Analog to Digital Converter A
.equ ACA_base = 0x0380		// Analog Comparator A
.equ RTC_base = 0x0400		// Real-Time Counter
.equ TWIC_base = 0x480		// Two-Wire Interface C
.equ TWIE_base = 0x4A0		// Two-Wire Interface E
.equ USB_base = 0x4C0		// Universal Serial Bus Module
.equ PORTA_base = 0x0600		// Port A
.equ PORTB_base = 0x0620		// Port B
.equ PORTC_base = 0x0640		// Port C
.equ PORTD_base = 0x0660		// Port D
.equ PORTE_base = 0x0680		// Port E
.equ PORTF_base = 0x06A0		// Port F
.equ PORTR_base = 0x07E0		// Port R
.equ TCC0_base = 0x800		// Timer/Counter C0
.equ TCC2_base = 0x800		// Timer/Counter C2
.equ TCC1_base = 0x840		// Timer/Counter C1
.equ AWEXC_base = 0x880		// Advanced Waveform Extension C
.equ HIRESC_base = 0x890		// High-Resolution Extension C
.equ USARTC0_base = 0x8A0		// Universal Asynchronous Receiver-Transmitter C0
.equ SPIC_base = 0x8C0		// Serial Peripheral Interface C
.equ IRCOM_base = 0x8F8		// IR Communication Module
.equ TCD0_base = 0x900		// Timer/Counter D0
.equ TCD2_base = 0x900		// Timer/Counter D2
.equ USARTD0_base = 0x9A0		// Universal Asynchronous Receiver-Transmitter D0
.equ SPID_base = 0x9C0		// Serial Peripheral Interface D
.equ TCE0_base = 0xA00		// Timer/Counter E0
.equ TCE2_base = 0xA00		// Timer/Counter E2
.equ USARTE0_base = 0xAA0		// Universal Asynchronous Receiver-Transmitter E0
.equ TCF0_base = 0xB00		// Timer/Counter F0
.equ TCF2_base = 0xB00		// Timer/Counter F2


; ***** IO REGISTER OFFSETS **********************************************


;***************************************************************************
;** GPIO - General Purpose IO
;***************************************************************************/
.equ GPIO_GPIOR0_offset = 0x00		// General Purpose IO Register 0
.equ GPIO_GPIOR1_offset = 0x01		// General Purpose IO Register 1
.equ GPIO_GPIOR2_offset = 0x02		// General Purpose IO Register 2
.equ GPIO_GPIOR3_offset = 0x03		// General Purpose IO Register 3

;***************************************************************************
;** VPORT - Virtual Ports
;***************************************************************************/
.equ VPORT_DIR_offset = 0x00		// I/O Port Data Direction
.equ VPORT_OUT_offset = 0x01		// I/O Port Output
.equ VPORT_IN_offset = 0x02		// I/O Port Input
.equ VPORT_INTFLAGS_offset = 0x03		// Interrupt Flag Register

;***************************************************************************
;** XOCD - On-Chip Debug System
;***************************************************************************/
.equ OCD_OCDR0_offset = 0x00		// OCD Register 0
.equ OCD_OCDR1_offset = 0x01		// OCD Register 1

;***************************************************************************
;** CPU - CPU
;***************************************************************************/
.equ CPU_CCP_offset = 0x04		// Configuration Change Protection
.equ CPU_RAMPD_offset = 0x08		// Ramp D
.equ CPU_RAMPX_offset = 0x09		// Ramp X
.equ CPU_RAMPY_offset = 0x0A		// Ramp Y
.equ CPU_RAMPZ_offset = 0x0B		// Ramp Z
.equ CPU_EIND_offset = 0x0C		// Extended Indirect Jump
.equ CPU_SPL_offset = 0x0D		// Stack Pointer Low
.equ CPU_SPH_offset = 0x0E		// Stack Pointer High
.equ CPU_SREG_offset = 0x0F		// Status Register

;***************************************************************************
;** CLK - Clock System
;***************************************************************************/
.equ CLK_CTRL_offset = 0x00		// Control Register
.equ CLK_PSCTRL_offset = 0x01		// Prescaler Control Register
.equ CLK_LOCK_offset = 0x02		// Lock register
.equ CLK_RTCCTRL_offset = 0x03		// RTC Control Register
.equ CLK_USBCTRL_offset = 0x04		// USB Control Register
.equ PR_PRGEN_offset = 0x00		// General Power Reduction
.equ PR_PRPA_offset = 0x01		// Power Reduction Port A
.equ PR_PRPC_offset = 0x03		// Power Reduction Port C
.equ PR_PRPD_offset = 0x04		// Power Reduction Port D
.equ PR_PRPE_offset = 0x05		// Power Reduction Port E
.equ PR_PRPF_offset = 0x06		// Power Reduction Port F

;***************************************************************************
;** SLEEP - Sleep Controller
;***************************************************************************/
.equ SLEEP_CTRL_offset = 0x00		// Control Register

;***************************************************************************
;** OSC - Oscillator
;***************************************************************************/
.equ OSC_CTRL_offset = 0x00		// Control Register
.equ OSC_STATUS_offset = 0x01		// Status Register
.equ OSC_XOSCCTRL_offset = 0x02		// External Oscillator Control Register
.equ OSC_XOSCFAIL_offset = 0x03		// Oscillator Failure Detection Register
.equ OSC_RC32KCAL_offset = 0x04		// 32.768 kHz Internal Oscillator Calibration Register
.equ OSC_PLLCTRL_offset = 0x05		// PLL Control Register
.equ OSC_DFLLCTRL_offset = 0x06		// DFLL Control Register

;***************************************************************************
;** DFLL - DFLL
;***************************************************************************/
.equ DFLL_CTRL_offset = 0x00		// Control Register
.equ DFLL_CALA_offset = 0x02		// Calibration Register A
.equ DFLL_CALB_offset = 0x03		// Calibration Register B
.equ DFLL_COMP0_offset = 0x04		// Oscillator Compare Register 0
.equ DFLL_COMP1_offset = 0x05		// Oscillator Compare Register 1
.equ DFLL_COMP2_offset = 0x06		// Oscillator Compare Register 2

;***************************************************************************
;** RST - Reset
;***************************************************************************/
.equ RST_STATUS_offset = 0x00		// Status Register
.equ RST_CTRL_offset = 0x01		// Control Register

;***************************************************************************
;** WDT - Watch-Dog Timer
;***************************************************************************/
.equ WDT_CTRL_offset = 0x00		// Control
.equ WDT_WINCTRL_offset = 0x01		// Windowed Mode Control
.equ WDT_STATUS_offset = 0x02		// Status

;***************************************************************************
;** MCU - MCU Control
;***************************************************************************/
.equ MCU_DEVID0_offset = 0x00		// Device ID byte 0
.equ MCU_DEVID1_offset = 0x01		// Device ID byte 1
.equ MCU_DEVID2_offset = 0x02		// Device ID byte 2
.equ MCU_REVID_offset = 0x03		// Revision ID
.equ MCU_ANAINIT_offset = 0x07		// Analog Startup Delay
.equ MCU_EVSYSLOCK_offset = 0x08		// Event System Lock
.equ MCU_AWEXLOCK_offset = 0x09		// AWEX Lock

;***************************************************************************
;** PMIC - Programmable Multi-level Interrupt Controller
;***************************************************************************/
.equ PMIC_STATUS_offset = 0x00		// Status Register
.equ PMIC_INTPRI_offset = 0x01		// Interrupt Priority
.equ PMIC_CTRL_offset = 0x02		// Control Register

;***************************************************************************
;** PORTCFG - Port Configuration
;***************************************************************************/
.equ PORTCFG_MPCMASK_offset = 0x00		// Multi-pin Configuration Mask
.equ PORTCFG_VPCTRLA_offset = 0x02		// Virtual Port Control Register A
.equ PORTCFG_VPCTRLB_offset = 0x03		// Virtual Port Control Register B
.equ PORTCFG_CLKEVOUT_offset = 0x04		// Clock and Event Out Register
.equ PORTCFG_EVOUTSEL_offset = 0x06		// Event Output Select

;***************************************************************************
;** CRC - Cyclic Redundancy Checker
;***************************************************************************/
.equ CRC_CTRL_offset = 0x00		// Control Register
.equ CRC_STATUS_offset = 0x01		// Status Register
.equ CRC_DATAIN_offset = 0x03		// Data Input
.equ CRC_CHECKSUM0_offset = 0x04		// Checksum byte 0
.equ CRC_CHECKSUM1_offset = 0x05		// Checksum byte 1
.equ CRC_CHECKSUM2_offset = 0x06		// Checksum byte 2
.equ CRC_CHECKSUM3_offset = 0x07		// Checksum byte 3

;***************************************************************************
;** EVSYS - Event System
;***************************************************************************/
.equ EVSYS_CH0MUX_offset = 0x00		// Event Channel 0 Multiplexer
.equ EVSYS_CH1MUX_offset = 0x01		// Event Channel 1 Multiplexer
.equ EVSYS_CH2MUX_offset = 0x02		// Event Channel 2 Multiplexer
.equ EVSYS_CH3MUX_offset = 0x03		// Event Channel 3 Multiplexer
.equ EVSYS_CH0CTRL_offset = 0x08		// Channel 0 Control Register
.equ EVSYS_CH1CTRL_offset = 0x09		// Channel 1 Control Register
.equ EVSYS_CH2CTRL_offset = 0x0A		// Channel 2 Control Register
.equ EVSYS_CH3CTRL_offset = 0x0B		// Channel 3 Control Register
.equ EVSYS_STROBE_offset = 0x10		// Event Strobe
.equ EVSYS_DATA_offset = 0x11		// Event Data

;***************************************************************************
;** NVM - Non Volatile Memory Controller
;***************************************************************************/
.equ NVM_ADDR0_offset = 0x00		// Address Register 0
.equ NVM_ADDR1_offset = 0x01		// Address Register 1
.equ NVM_ADDR2_offset = 0x02		// Address Register 2
.equ NVM_DATA0_offset = 0x04		// Data Register 0
.equ NVM_DATA1_offset = 0x05		// Data Register 1
.equ NVM_DATA2_offset = 0x06		// Data Register 2
.equ NVM_CMD_offset = 0x0A		// Command
.equ NVM_CTRLA_offset = 0x0B		// Control Register A
.equ NVM_CTRLB_offset = 0x0C		// Control Register B
.equ NVM_INTCTRL_offset = 0x0D		// Interrupt Control
.equ NVM_STATUS_offset = 0x0F		// Status
.equ NVM_LOCKBITS_offset = 0x10		// Lock Bits

;***************************************************************************
;** ADC - Analog/Digital Converter
;***************************************************************************/
.equ ADC_CH_CTRL_offset = 0x00		// Control Register
.equ ADC_CH_MUXCTRL_offset = 0x01		// MUX Control
.equ ADC_CH_INTCTRL_offset = 0x02		// Channel Interrupt Control Register
.equ ADC_CH_INTFLAGS_offset = 0x03		// Interrupt Flags
.equ ADC_CH_RES_offset = 0x04		// Channel Result
.equ ADC_CH_SCAN_offset = 0x06		// Input Channel Scan
.equ ADC_CTRLA_offset = 0x00		// Control Register A
.equ ADC_CTRLB_offset = 0x01		// Control Register B
.equ ADC_REFCTRL_offset = 0x02		// Reference Control
.equ ADC_EVCTRL_offset = 0x03		// Event Control
.equ ADC_PRESCALER_offset = 0x04		// Clock Prescaler
.equ ADC_INTFLAGS_offset = 0x06		// Interrupt Flags
.equ ADC_TEMP_offset = 0x07		// Temporary Register
.equ ADC_CAL_offset = 0x0C		// Calibration Value
.equ ADC_CH0RES_offset = 0x10		// Channel 0 Result
.equ ADC_CMP_offset = 0x18		// Compare Value
.equ ADC_CH0_offset = 0x20		// ADC Channel 0

;***************************************************************************
;** AC - Analog Comparator
;***************************************************************************/
.equ AC_AC0CTRL_offset = 0x00		// Analog Comparator 0 Control
.equ AC_AC1CTRL_offset = 0x01		// Analog Comparator 1 Control
.equ AC_AC0MUXCTRL_offset = 0x02		// Analog Comparator 0 MUX Control
.equ AC_AC1MUXCTRL_offset = 0x03		// Analog Comparator 1 MUX Control
.equ AC_CTRLA_offset = 0x04		// Control Register A
.equ AC_CTRLB_offset = 0x05		// Control Register B
.equ AC_WINCTRL_offset = 0x06		// Window Mode Control
.equ AC_STATUS_offset = 0x07		// Status

;***************************************************************************
;** RTC - Real-Time Clounter
;***************************************************************************/
.equ RTC_CTRL_offset = 0x00		// Control Register
.equ RTC_STATUS_offset = 0x01		// Status Register
.equ RTC_INTCTRL_offset = 0x02		// Interrupt Control Register
.equ RTC_INTFLAGS_offset = 0x03		// Interrupt Flags
.equ RTC_TEMP_offset = 0x04		// Temporary register
.equ RTC_CNT_offset = 0x08		// Count Register
.equ RTC_PER_offset = 0x0A		// Period Register
.equ RTC_COMP_offset = 0x0C		// Compare Register

;***************************************************************************
;** TWI - Two-Wire Interface
;***************************************************************************/
.equ TWI_MASTER_CTRLA_offset = 0x00		// Control Register A
.equ TWI_MASTER_CTRLB_offset = 0x01		// Control Register B
.equ TWI_MASTER_CTRLC_offset = 0x02		// Control Register C
.equ TWI_MASTER_STATUS_offset = 0x03		// Status Register
.equ TWI_MASTER_BAUD_offset = 0x04		// Baurd Rate Control Register
.equ TWI_MASTER_ADDR_offset = 0x05		// Address Register
.equ TWI_MASTER_DATA_offset = 0x06		// Data Register
.equ TWI_SLAVE_CTRLA_offset = 0x00		// Control Register A
.equ TWI_SLAVE_CTRLB_offset = 0x01		// Control Register B
.equ TWI_SLAVE_STATUS_offset = 0x02		// Status Register
.equ TWI_SLAVE_ADDR_offset = 0x03		// Address Register
.equ TWI_SLAVE_DATA_offset = 0x04		// Data Register
.equ TWI_SLAVE_ADDRMASK_offset = 0x05		// Address Mask Register
.equ TWI_CTRL_offset = 0x00		// TWI Common Control Register
.equ TWI_MASTER_offset = 0x0001		// TWI master module
.equ TWI_SLAVE_offset = 0x0008		// TWI slave module

;***************************************************************************
;** USB - USB
;***************************************************************************/
.equ USB_EP_STATUS_offset = 0x00		// Endpoint Status
.equ USB_EP_CTRL_offset = 0x01		// Endpoint Control
.equ USB_EP_CNT_offset = 0x02		// USB Endpoint Counter
.equ USB_EP_DATAPTR_offset = 0x04		// Data Pointer
.equ USB_EP_AUXDATA_offset = 0x06		// Auxiliary Data
.equ USB_CTRLA_offset = 0x00		// Control Register A
.equ USB_CTRLB_offset = 0x01		// Control Register B
.equ USB_STATUS_offset = 0x02		// Status Register
.equ USB_ADDR_offset = 0x03		// Address Register
.equ USB_FIFOWP_offset = 0x04		// FIFO Write Pointer Register
.equ USB_FIFORP_offset = 0x05		// FIFO Read Pointer Register
.equ USB_EPPTR_offset = 0x06		// Endpoint Configuration Table Pointer
.equ USB_INTCTRLA_offset = 0x08		// Interrupt Control Register A
.equ USB_INTCTRLB_offset = 0x09		// Interrupt Control Register B
.equ USB_INTFLAGSACLR_offset = 0x0A		// Clear Interrupt Flag Register A
.equ USB_INTFLAGSASET_offset = 0x0B		// Set Interrupt Flag Register A
.equ USB_INTFLAGSBCLR_offset = 0x0C		// Clear Interrupt Flag Register B
.equ USB_INTFLAGSBSET_offset = 0x0D		// Set Interrupt Flag Register B
.equ USB_CAL0_offset = 0x3A		// Calibration Byte 0
.equ USB_CAL1_offset = 0x3B		// Calibration Byte 1
.equ USB_EP_TABLE_EP0OUT_offset = 0x00		// Endpoint 0
.equ USB_EP_TABLE_EP0IN_offset = 0x08		// Endpoint 0
.equ USB_EP_TABLE_EP1OUT_offset = 0x10		// Endpoint 1
.equ USB_EP_TABLE_EP1IN_offset = 0x18		// Endpoint 1
.equ USB_EP_TABLE_EP2OUT_offset = 0x20		// Endpoint 2
.equ USB_EP_TABLE_EP2IN_offset = 0x28		// Endpoint 2
.equ USB_EP_TABLE_EP3OUT_offset = 0x30		// Endpoint 3
.equ USB_EP_TABLE_EP3IN_offset = 0x38		// Endpoint 3
.equ USB_EP_TABLE_EP4OUT_offset = 0x40		// Endpoint 4
.equ USB_EP_TABLE_EP4IN_offset = 0x48		// Endpoint 4
.equ USB_EP_TABLE_EP5OUT_offset = 0x50		// Endpoint 5
.equ USB_EP_TABLE_EP5IN_offset = 0x58		// Endpoint 5
.equ USB_EP_TABLE_EP6OUT_offset = 0x60		// Endpoint 6
.equ USB_EP_TABLE_EP6IN_offset = 0x68		// Endpoint 6
.equ USB_EP_TABLE_EP7OUT_offset = 0x70		// Endpoint 7
.equ USB_EP_TABLE_EP7IN_offset = 0x78		// Endpoint 7
.equ USB_EP_TABLE_EP8OUT_offset = 0x80		// Endpoint 8
.equ USB_EP_TABLE_EP8IN_offset = 0x88		// Endpoint 8
.equ USB_EP_TABLE_EP9OUT_offset = 0x90		// Endpoint 9
.equ USB_EP_TABLE_EP9IN_offset = 0x98		// Endpoint 9
.equ USB_EP_TABLE_EP10OUT_offset = 0xA0		// Endpoint 10
.equ USB_EP_TABLE_EP10IN_offset = 0xA8		// Endpoint 10
.equ USB_EP_TABLE_EP11OUT_offset = 0xB0		// Endpoint 11
.equ USB_EP_TABLE_EP11IN_offset = 0xB8		// Endpoint 11
.equ USB_EP_TABLE_EP12OUT_offset = 0xC0		// Endpoint 12
.equ USB_EP_TABLE_EP12IN_offset = 0xC8		// Endpoint 12
.equ USB_EP_TABLE_EP13OUT_offset = 0xD0		// Endpoint 13
.equ USB_EP_TABLE_EP13IN_offset = 0xD8		// Endpoint 13
.equ USB_EP_TABLE_EP14OUT_offset = 0xE0		// Endpoint 14
.equ USB_EP_TABLE_EP14IN_offset = 0xE8		// Endpoint 14
.equ USB_EP_TABLE_EP15OUT_offset = 0xF0		// Endpoint 15
.equ USB_EP_TABLE_EP15IN_offset = 0xF8		// Endpoint 15
.equ USB_EP_TABLE_FRAMENUML_offset = 0x110		// Frame Number Low Byte
.equ USB_EP_TABLE_FRAMENUMH_offset = 0x111		// Frame Number High Byte

;***************************************************************************
;** PORT - I/O Port Configuration
;***************************************************************************/
.equ PORT_DIR_offset = 0x00		// I/O Port Data Direction
.equ PORT_DIRSET_offset = 0x01		// I/O Port Data Direction Set
.equ PORT_DIRCLR_offset = 0x02		// I/O Port Data Direction Clear
.equ PORT_DIRTGL_offset = 0x03		// I/O Port Data Direction Toggle
.equ PORT_OUT_offset = 0x04		// I/O Port Output
.equ PORT_OUTSET_offset = 0x05		// I/O Port Output Set
.equ PORT_OUTCLR_offset = 0x06		// I/O Port Output Clear
.equ PORT_OUTTGL_offset = 0x07		// I/O Port Output Toggle
.equ PORT_IN_offset = 0x08		// I/O port Input
.equ PORT_INTCTRL_offset = 0x09		// Interrupt Control Register
.equ PORT_INT0MASK_offset = 0x0A		// Port Interrupt 0 Mask
.equ PORT_INT1MASK_offset = 0x0B		// Port Interrupt 1 Mask
.equ PORT_INTFLAGS_offset = 0x0C		// Interrupt Flag Register
.equ PORT_REMAP_offset = 0x0E		// I/O Port Pin Remap Register
.equ PORT_PIN0CTRL_offset = 0x10		// Pin 0 Control Register
.equ PORT_PIN1CTRL_offset = 0x11		// Pin 1 Control Register
.equ PORT_PIN2CTRL_offset = 0x12		// Pin 2 Control Register
.equ PORT_PIN3CTRL_offset = 0x13		// Pin 3 Control Register
.equ PORT_PIN4CTRL_offset = 0x14		// Pin 4 Control Register
.equ PORT_PIN5CTRL_offset = 0x15		// Pin 5 Control Register
.equ PORT_PIN6CTRL_offset = 0x16		// Pin 6 Control Register
.equ PORT_PIN7CTRL_offset = 0x17		// Pin 7 Control Register

;***************************************************************************
;** TC - 16-bit Timer/Counter With PWM
;***************************************************************************/
.equ TC0_CTRLA_offset = 0x00		// Control  Register A
.equ TC0_CTRLB_offset = 0x01		// Control Register B
.equ TC0_CTRLC_offset = 0x02		// Control register C
.equ TC0_CTRLD_offset = 0x03		// Control Register D
.equ TC0_CTRLE_offset = 0x04		// Control Register E
.equ TC0_INTCTRLA_offset = 0x06		// Interrupt Control Register A
.equ TC0_INTCTRLB_offset = 0x07		// Interrupt Control Register B
.equ TC0_CTRLFCLR_offset = 0x08		// Control Register F Clear
.equ TC0_CTRLFSET_offset = 0x09		// Control Register F Set
.equ TC0_CTRLGCLR_offset = 0x0A		// Control Register G Clear
.equ TC0_CTRLGSET_offset = 0x0B		// Control Register G Set
.equ TC0_INTFLAGS_offset = 0x0C		// Interrupt Flag Register
.equ TC0_TEMP_offset = 0x0F		// Temporary Register For 16-bit Access
.equ TC0_CNT_offset = 0x20		// Count
.equ TC0_PER_offset = 0x26		// Period
.equ TC0_CCA_offset = 0x28		// Compare or Capture A
.equ TC0_CCB_offset = 0x2A		// Compare or Capture B
.equ TC0_CCC_offset = 0x2C		// Compare or Capture C
.equ TC0_CCD_offset = 0x2E		// Compare or Capture D
.equ TC0_PERBUF_offset = 0x36		// Period Buffer
.equ TC0_CCABUF_offset = 0x38		// Compare Or Capture A Buffer
.equ TC0_CCBBUF_offset = 0x3A		// Compare Or Capture B Buffer
.equ TC0_CCCBUF_offset = 0x3C		// Compare Or Capture C Buffer
.equ TC0_CCDBUF_offset = 0x3E		// Compare Or Capture D Buffer
.equ TC1_CTRLA_offset = 0x00		// Control  Register A
.equ TC1_CTRLB_offset = 0x01		// Control Register B
.equ TC1_CTRLC_offset = 0x02		// Control register C
.equ TC1_CTRLD_offset = 0x03		// Control Register D
.equ TC1_CTRLE_offset = 0x04		// Control Register E
.equ TC1_INTCTRLA_offset = 0x06		// Interrupt Control Register A
.equ TC1_INTCTRLB_offset = 0x07		// Interrupt Control Register B
.equ TC1_CTRLFCLR_offset = 0x08		// Control Register F Clear
.equ TC1_CTRLFSET_offset = 0x09		// Control Register F Set
.equ TC1_CTRLGCLR_offset = 0x0A		// Control Register G Clear
.equ TC1_CTRLGSET_offset = 0x0B		// Control Register G Set
.equ TC1_INTFLAGS_offset = 0x0C		// Interrupt Flag Register
.equ TC1_TEMP_offset = 0x0F		// Temporary Register For 16-bit Access
.equ TC1_CNT_offset = 0x20		// Count
.equ TC1_PER_offset = 0x26		// Period
.equ TC1_CCA_offset = 0x28		// Compare or Capture A
.equ TC1_CCB_offset = 0x2A		// Compare or Capture B
.equ TC1_PERBUF_offset = 0x36		// Period Buffer
.equ TC1_CCABUF_offset = 0x38		// Compare Or Capture A Buffer
.equ TC1_CCBBUF_offset = 0x3A		// Compare Or Capture B Buffer

