trol73/avr-make/asm/include/ATxmega256C3def.inc
; Definitions used by the assembler
#pragma AVRPART MEMORY PROG_FLASH 0x42000
#pragma AVRPART MEMORY EEPROM 0x1000
#pragma AVRPART MEMORY INT_SRAM SIZE 0x4000
#pragma AVRPART MEMORY INT_SRAM START_ADDR 0x2000



; ***** INTERRUPT VECTORS, ABSOLUTE ADDRESSES ****************************

; OSC interrupt vectors
.equ OSC_OSCF_vect = 2 ; Oscillator Failure Interrupt (NMI)

; PORTC interrupt vectors
.equ PORTC_INT0_vect = 4 ; External Interrupt 0
.equ PORTC_INT1_vect = 6 ; External Interrupt 1

; PORTR interrupt vectors
.equ PORTR_INT0_vect = 8 ; External Interrupt 0
.equ PORTR_INT1_vect = 10 ; External Interrupt 1

; RTC interrupt vectors
.equ RTC_OVF_vect = 20 ; Overflow Interrupt
.equ RTC_COMP_vect = 22 ; Compare Interrupt

; TWIC interrupt vectors
.equ TWIC_TWIS_vect = 24 ; TWI Slave Interrupt
.equ TWIC_TWIM_vect = 26 ; TWI Master Interrupt

; TCC0 interrupt vectors
.equ TCC0_OVF_vect = 28 ; Overflow Interrupt
.equ TCC0_ERR_vect = 30 ; Error Interrupt
.equ TCC0_CCA_vect = 32 ; Compare or Capture A Interrupt
.equ TCC0_CCB_vect = 34 ; Compare or Capture B Interrupt
.equ TCC0_CCC_vect = 36 ; Compare or Capture C Interrupt
.equ TCC0_CCD_vect = 38 ; Compare or Capture D Interrupt

; TCC2 interrupt vectors
.equ TCC2_LUNF_vect = 28 ; Low Byte Underflow Interrupt
.equ TCC2_HUNF_vect = 30 ; High Byte Underflow Interrupt
.equ TCC2_LCMPA_vect = 32 ; Low Byte Compare A Interrupt
.equ TCC2_LCMPB_vect = 34 ; Low Byte Compare B Interrupt
.equ TCC2_LCMPC_vect = 36 ; Low Byte Compare C Interrupt
.equ TCC2_LCMPD_vect = 38 ; Low Byte Compare D Interrupt

; TCC1 interrupt vectors
.equ TCC1_OVF_vect = 40 ; Overflow Interrupt
.equ TCC1_ERR_vect = 42 ; Error Interrupt
.equ TCC1_CCA_vect = 44 ; Compare or Capture A Interrupt
.equ TCC1_CCB_vect = 46 ; Compare or Capture B Interrupt

; SPIC interrupt vectors
.equ SPIC_INT_vect = 48 ; SPI Interrupt

; USARTC0 interrupt vectors
.equ USARTC0_RXC_vect = 50 ; Reception Complete Interrupt
.equ USARTC0_DRE_vect = 52 ; Data Register Empty Interrupt
.equ USARTC0_TXC_vect = 54 ; Transmission Complete Interrupt

; NVM interrupt vectors
.equ NVM_EE_vect = 64 ; EE Interrupt
.equ NVM_SPM_vect = 66 ; SPM Interrupt

; PORTB interrupt vectors
.equ PORTB_INT0_vect = 68 ; External Interrupt 0
.equ PORTB_INT1_vect = 70 ; External Interrupt 1

; PORTE interrupt vectors
.equ PORTE_INT0_vect = 86 ; External Interrupt 0
.equ PORTE_INT1_vect = 88 ; External Interrupt 1

; TWIE interrupt vectors
.equ TWIE_TWIS_vect = 90 ; TWI Slave Interrupt
.equ TWIE_TWIM_vect = 92 ; TWI Master Interrupt

; TCE0 interrupt vectors
.equ TCE0_OVF_vect = 94 ; Overflow Interrupt
.equ TCE0_ERR_vect = 96 ; Error Interrupt
.equ TCE0_CCA_vect = 98 ; Compare or Capture A Interrupt
.equ TCE0_CCB_vect = 100 ; Compare or Capture B Interrupt
.equ TCE0_CCC_vect = 102 ; Compare or Capture C Interrupt
.equ TCE0_CCD_vect = 104 ; Compare or Capture D Interrupt

; TCE2 interrupt vectors
.equ TCE2_LUNF_vect = 94 ; Low Byte Underflow Interrupt
.equ TCE2_HUNF_vect = 96 ; High Byte Underflow Interrupt
.equ TCE2_LCMPA_vect = 98 ; Low Byte Compare A Interrupt
.equ TCE2_LCMPB_vect = 100 ; Low Byte Compare B Interrupt
.equ TCE2_LCMPC_vect = 102 ; Low Byte Compare C Interrupt
.equ TCE2_LCMPD_vect = 104 ; Low Byte Compare D Interrupt

; USARTE0 interrupt vectors
.equ USARTE0_RXC_vect = 116 ; Reception Complete Interrupt
.equ USARTE0_DRE_vect = 118 ; Data Register Empty Interrupt
.equ USARTE0_TXC_vect = 120 ; Transmission Complete Interrupt

; PORTD interrupt vectors
.equ PORTD_INT0_vect = 128 ; External Interrupt 0
.equ PORTD_INT1_vect = 130 ; External Interrupt 1

; PORTA interrupt vectors
.equ PORTA_INT0_vect = 132 ; External Interrupt 0
.equ PORTA_INT1_vect = 134 ; External Interrupt 1

; ACA interrupt vectors
.equ ACA_AC0_vect = 136 ; AC0 Interrupt
.equ ACA_AC1_vect = 138 ; AC1 Interrupt
.equ ACA_ACW_vect = 140 ; ACW Window Mode Interrupt

; ADCA interrupt vectors
.equ ADCA_CH0_vect = 142 ; Interrupt 0

; TCD0 interrupt vectors
.equ TCD0_OVF_vect = 154 ; Overflow Interrupt
.equ TCD0_ERR_vect = 156 ; Error Interrupt
.equ TCD0_CCA_vect = 158 ; Compare or Capture A Interrupt
.equ TCD0_CCB_vect = 160 ; Compare or Capture B Interrupt
.equ TCD0_CCC_vect = 162 ; Compare or Capture C Interrupt
.equ TCD0_CCD_vect = 164 ; Compare or Capture D Interrupt

; TCD2 interrupt vectors
.equ TCD2_LUNF_vect = 154 ; Low Byte Underflow Interrupt
.equ TCD2_HUNF_vect = 156 ; High Byte Underflow Interrupt
.equ TCD2_LCMPA_vect = 158 ; Low Byte Compare A Interrupt
.equ TCD2_LCMPB_vect = 160 ; Low Byte Compare B Interrupt
.equ TCD2_LCMPC_vect = 162 ; Low Byte Compare C Interrupt
.equ TCD2_LCMPD_vect = 164 ; Low Byte Compare D Interrupt

; SPID interrupt vectors
.equ SPID_INT_vect = 174 ; SPI Interrupt

; USARTD0 interrupt vectors
.equ USARTD0_RXC_vect = 176 ; Reception Complete Interrupt
.equ USARTD0_DRE_vect = 178 ; Data Register Empty Interrupt
.equ USARTD0_TXC_vect = 180 ; Transmission Complete Interrupt

; PORTF interrupt vectors
.equ PORTF_INT0_vect = 208 ; External Interrupt 0
.equ PORTF_INT1_vect = 210 ; External Interrupt 1

; TCF0 interrupt vectors
.equ TCF0_OVF_vect = 216 ; Overflow Interrupt
.equ TCF0_ERR_vect = 218 ; Error Interrupt
.equ TCF0_CCA_vect = 220 ; Compare or Capture A Interrupt
.equ TCF0_CCB_vect = 222 ; Compare or Capture B Interrupt
.equ TCF0_CCC_vect = 224 ; Compare or Capture C Interrupt
.equ TCF0_CCD_vect = 226 ; Compare or Capture D Interrupt

; TCF2 interrupt vectors
.equ TCF2_LUNF_vect = 216 ; Low Byte Underflow Interrupt
.equ TCF2_HUNF_vect = 218 ; High Byte Underflow Interrupt
.equ TCF2_LCMPA_vect = 220 ; Low Byte Compare A Interrupt
.equ TCF2_LCMPB_vect = 222 ; Low Byte Compare B Interrupt
.equ TCF2_LCMPC_vect = 224 ; Low Byte Compare C Interrupt
.equ TCF2_LCMPD_vect = 226 ; Low Byte Compare D Interrupt

; USB interrupt vectors
.equ USB_BUSEVENT_vect = 250 ; SOF, suspend, resume, reset bus event interrupts, crc, underflow, overflow and stall error interrupts
.equ USB_TRNCOMPL_vect = 252 ; Transaction complete interrupt



; ***** INTERRUPT VECTORS, MODULE BASES **********************************

.equ OSC_vbase = 2
.equ PORTC_vbase = 4
.equ PORTR_vbase = 8
.equ RTC_vbase = 20
.equ TWIC_vbase = 24
.equ TCC0_vbase = 28
.equ TCC2_vbase = 28
.equ TCC1_vbase = 40
.equ SPIC_vbase = 48
.equ USARTC0_vbase = 50
.equ NVM_vbase = 64
.equ PORTB_vbase = 68
.equ PORTE_vbase = 86
.equ TWIE_vbase = 90
.equ TCE0_vbase = 94
.equ TCE2_vbase = 94
.equ USARTE0_vbase = 116
.equ PORTD_vbase = 128
.equ PORTA_vbase = 132
.equ ACA_vbase = 136
.equ ADCA_vbase = 142
.equ TCD0_vbase = 154
.equ TCD2_vbase = 154
.equ SPID_vbase = 174
.equ USARTD0_vbase = 176
.equ PORTF_vbase = 208
.equ TCF0_vbase = 216
.equ TCF2_vbase = 216
.equ USB_vbase = 250


; ***** INTERRUPT VECTORS, VECTOR OFFSETS *********************************

; OSC interrupt vector offsets

